# Pandas

In [4]:
#para identificar de donde esta importando los archivos externos
import os
os.getcwd() 
#si se quiere cambiar la dirección se escribe:
#os.chdir("C:\\Documents")
#os.getcwd()

'c:\\Users\\lelop\\OneDrive - UNIVERSIDAD DE CALDAS\\Clases\\Python\\Curso en Ciencia de Datos - Udenar'

Primero importamos las librerias:

In [5]:
import numpy as np
import pandas as pd

Importamos del archivo *sample.xlsx* la hoja "Plantulas" (hoja 13)

In [11]:
plantulas1 = pd.read_excel("sample.xlsx",sheet_name=12,header=0)
plantulas1.info() #para visualizar el contenido a nivel general

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Parcela   55 non-null     int64
 1   NI        55 non-null     int64
 2   Plantula  55 non-null     int64
 3   Ni        55 non-null     int64
 4   Altura    55 non-null     int64
dtypes: int64(5)
memory usage: 2.3 KB

In [13]:
plantulas1.head(5) #nos muestra los 5 primeros registros

   Parcela  NI  Plantula  Ni  Altura
0        3  50         1  52      12
1        3  50         2  52      11
2        3  50         3  52      12
3        3  50         4  52      10
4        3  50         5  52      13

In [14]:
plantulas1.tail(3) #nos muestra los últimos 3 registros

    Parcela  NI  Plantula  Ni  Altura
52       50  50        53  45      13
53       50  50        54  45      12
54       50  50        55  45      12

In [31]:
plantulas1.iloc[2:8:2] #nos imprime las filas impares desde la tercera hasta la séptima name_var.iloc[a:b:h]

   Parcela  NI  Plantula  Ni  Altura
2        3  50         3  52      12
4        3  50         5  52      13
6        6  50         7  56       9

In [17]:
plantulas1.columns #nos muestra en nombre de las columnas (variables)

Index(['Parcela', 'NI', 'Plantula', 'Ni', 'Altura'], dtype='object')

In [34]:
X = plantulas1[['Plantula','Altura']] #guardamos en X los datos de las variables 'Plantula' y 'Altura'
X.head(5)

   Plantula  Altura
0         1      12
1         2      11
2         3      12
3         4      10
4         5      13

In [36]:
X.iloc[3,1] #entrada en la cuarta fila y segunda columna

np.int64(10)

In [38]:
plantulas1.loc[plantulas1['Parcela'] == 3] #muestra las filas donde 'Parcela' tiene el valor 3

   Parcela  NI  Plantula  Ni  Altura
0        3  50         1  52      12
1        3  50         2  52      11
2        3  50         3  52      12
3        3  50         4  52      10
4        3  50         5  52      13

In [39]:
plantulas1.describe() #muestra resultados estadísticos sobre cada variables

         Parcela    NI  Plantula         Ni     Altura
count  55.000000  55.0  55.00000  55.000000  55.000000
mean   22.618182  50.0  28.00000  53.309091   9.418182
std    14.344299   0.0  16.02082   5.773094   2.622488
min     3.000000  50.0   1.00000  45.000000   4.000000
25%     8.000000  50.0  14.50000  49.000000   7.000000
50%    24.000000  50.0  28.00000  52.000000   9.000000
75%    32.000000  50.0  41.50000  60.000000  12.000000
max    50.000000  50.0  55.00000  61.000000  15.000000

In [43]:
p_altura = plantulas1.sort_values("Altura",ascending=False) #ordena la tabla de acuerdo a la variable 'Altura' de forma descendente. Si se desea ascendente se pone ascending=True
p_altura.head(10)

    Parcela  NI  Plantula  Ni  Altura
28       24  50        29  51      15
27       24  50        28  51      14
4         3  50         5  52      13
29       24  50        30  51      13
24       22  50        25  49      13
52       50  50        53  45      13
31       24  50        32  51      13
25       22  50        26  49      12
30       24  50        31  51      12
2         3  50         3  52      12

Ahora hacemos selecciones más específicas:

In [62]:
plantulas2 = pd.read_excel('sample.xlsx',sheet_name='Plantulas',header=0,usecols=[0,2,4],names=['IdParcela','IdPlantula','Altura'],dtype={'IdParcela':str,'IdPlantula':str,'Altura':np.float64})
plantulas2.head(10)

  IdParcela IdPlantula  Altura
0         3          1    12.0
1         3          2    11.0
2         3          3    12.0
3         3          4    10.0
4         3          5    13.0
5         6          6    10.0
6         6          7     9.0
7         6          8     7.0
8         6          9     9.0
9         6         10     8.0

In [65]:
plantulas2.to_excel('sample2.xlsx', index=False) #guarda los datos de plantulas2 en un archivo sample2.xlsx sin los índices

**iniciar video con tiempo 01:17:17** (#6 contando de arriba hacia abajo)